## 3.1. Создание фрейма данных
## Задача
Требуется создать новый фрейм данных.

In [1]:
import pandas as pd

In [2]:
dataframe = pd.DataFrame()

In [21]:
dataframe['Name'] = ['Alex Alelee','Stiven Stivenson']
dataframe['Age'] = [38,25]
dataframe['Driver'] = [True,False]

In [23]:
dataframe

               Name  Age  Driver
0       Alex Alelee   38    True
1  Stiven Stivenson   25   False

## 3.2. Описание данных
## Задача
Требуется взглянуть на некоторые характеристики фрейма данных

## 3.3. Навигация по фреймам данных
## Задача
Требуется выбрать индивидуальные данные или срезы фрейма данных.

In [42]:
# Показать строку
dataframe.iloc[1]

Name      Stiven Stivenson
Age                     25
Driver               False
Name: Stiven Stivenson, dtype: object

In [36]:
dataframe.iloc[0:2]

               Name  Age  Driver
0       Alex Alelee   38    True
1  Stiven Stivenson   25   False

In [44]:
# Задать индекс
dataframe = dataframe.set_index(dataframe['Name'])
dataframe

                              Name  Age  Driver
Name
Alex Alelee            Alex Alelee   38    True
Stiven Stivenson  Stiven Stivenson   25   False

## 3.4. Выбор строк на основе условных конструкций
## Задача
Требуется отобрать строки фрейма данных на основе некоторого условия.

In [58]:
dataframe[dataframe['Age'] > 25].head()

                    Name  Age  Driver
Name
Alex Alelee  Alex Alelee   38    True